<?php 

 	$favorBooks = array('451° по Фаренгейту', 'Шантарам', 1984, 'Мастер и Маргарита', 'Три товарища', 'Портрет Дориана Грея','Вино из одуванчиков' ,'Цветы для Элджернона', 'Над пропастью во ржи', 'Маленький принц', 'Анна Каренина' ,'Сто лет одиночества' ,'Тень горы' ,'Атлант расправил плечи');
 	
 	$favorFoods = array('Салат Греческий', 'Салат Цезарь', 'Стейк судака с овощами', 'Шашлык из баранины', 'Мидальон из говядины с брусничным соусом','Шашлык из семги' ,'Куриное филе с баклажанами', 'Наполеон', 'Тирамису', 'Чизкейк' ,'Медовое' ,'Чай зеленый' ,'Сок виноградный');


 	echo "<h1> Любимые произведения </h1>";
 	echo "<ol>";
 	 for($i = 0; $i< count($favorBooks); $i++){
 		echo "<li> $favorBooks[$i] </li>";
 	}
 	echo "</ol>";


 	echo "<h1> Любимые блюда </h1>";
 	echo "<h3> Салаты: </h3>";
 	echo "<ol>";
 	 for($i = 0; $i< 2; $i++){
 		echo "<li> $favorFoods[$i] </li>";
 	}
 	echo "</ol>";


 	echo "<h3> Горячее: </h3>";
 	echo "<ol>";
 	 for($i = 2; $i< 7; $i++){
 		echo "<li> $favorFoods[$i] </li>";
 	}
 	echo "</ol>";


 	echo "<h3> Десерты: </h3>";
 	echo "<ol>";
 	 for($i = 7; $i< 11; $i++){
 		echo "<li> $favorFoods[$i] </li>";
 	}
 	echo "</ol>";


 	echo "<h3> Напитки: </h3>";
 	echo "<ol>";
 	 for($i = 11; $i< count($favorFoods); $i++){
 		echo "<li> $favorFoods[$i] </li>";
 	}
 	echo "</ol>";

 ?>